[

    {
        "title": "Bike Watching",
        "year": "2025",
        "image": "../images/Boston.png",
        "description": "An interactive map visualization displaying Boston's bike traffic patterns over time using Mapbox and D3.js. Includes dynamic filtering, time-based analysis, and a legend for traffic flow trends.",
        "url": "https://dhp003.github.io/bikewatching/"
    },

    {
        "title": "Personal Portfolio Website",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A personal portfolio showcasing my projects and skills in web development and data science. Made a public facing website to showcase. Managed code via Github version control."
    },
    {
        "title": "K-Nearest Neighbours Classifier",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Made a classifier that can classify hand-written numerical images into a digit with 98% accuracy. Enhanced model performance through parameter tuning and feature scaling, improving processing speed. "
    },
    {
        "title": "Sentimental Analysis",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed and deployed a robust sentiment analysis pipeline using Python and NLP libaries, optimizing real-time data processing and sentiment tracking with 96% accuracy. Developed automated reporting tools."
    },
    {
        "title": "Data Analysis and Model Building",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Conducted in-depth analysis of complex datasets, including missingness assessment, prediction model development, and fairness evaluation. Created a public-facing showcase to present said findings. "
    },
    {
        "title": "Government Dashboard Development",
        "year": "2019",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a government dashboard using Java, incorporating features such as real time feedbacl systems and progress bares to enhance interactivity and user engagement."
    },
    {
        "title": "Deceptive Visualization Analysis",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A project that explores the effects of design choices in data cisualization on the perception of the story it tells to the user.  "
    },
    {
        "title": "Predictive Modeling",
        "year":"2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A detailed research project focusing on predictive modeling using real world datasets from Kaggle. The project included exploratory data analysis, model selection and performance evaluation. "
    },
    {
        "title": "Plagiarism Checker",
        "year":"2019",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A python based plagiarism detection tool that analyzes text similarity using NLP techniques. The project implemented TF-IDF vectorization and cosine similarity to compare documents, highlighting potential copied content."
    },
    {
        "title": "Inventory Management System",
        "year":"2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A java based web application designed for a local grocery store to efficiently manage inventory. Allows store managers to track stock levels, update product details, and generate sale reports. "
    },
    {
        "title": "Dynamic Fiber Optic Display",
        "year":"2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Designed and deployed a dynamic fiber optic display that can deplicate an image in 3d ways. Hardware makes use of fiber optic cables, servos, mototrs, pulley systems etc."
    },
    {
        "title": "Robotic Flower",
        "year":"2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Used Raspberry Pi to make software for a robotic arm that uses computer vision to bloom the robotic flower when user is smiling and wilt otherwise with 92% accuracy. Uses open CV. "
    },
    {
        "title": "Visualization of Healthcare Data ",
        "year":"2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built data visualization that tells a story about healthcare experiment - Body temperature of students in examinations to answer the question 'Does stress lower performance efficiency in Tests?' "
    }
]